#include "sdk.h"
#include "IconsFontAwesome.h"
#include "xor.h"
#include <wininet.h>
#include <future>
#include <urlmon.h>
#pragma comment(lib, "urlmon.lib")

#pragma warning(disable : 4996)

HWND process::hwnd;

#include <json/json.hpp>
#include "menu.h"
#include <cstdarg>
#include "utility.h"
using json = nlohmann::json;

std::string serverBoolFile;
bool serverConnected;

int boolToInt(bool btoi)
{
	if (btoi == true)
	{
		return 1;
	}
	else
	{
		return 0;
	}
}

bool intToBool(int itob)
{
	if (itob == 1)
	{
		return true;
	}
	else
	{
		return false;
	}
}

void saveConfig(int configNumber) {
	std::filesystem::create_directories(var->Settings.docuPath);
	std::string path = var->Settings.docuPath + "\\config" + std::to_string(configNumber) + ".json";
	remove(path.c_str());
	std::ofstream log(path.c_str(), std::ofstream::app | std::ofstream::out);

	json j;
	j["keybinds"] = { {"disable", var->Settings.cfg.i_disablekey}, {"menu1", var->Settings.cfg.i_menukey}, {"menu2", var->Settings.cfg.i_menu2key}, {"eject", var->Settings.cfg.i_ejectkey},
		{"unlockall", var->Settings.cfg.i_unlockallkey}, {"reversecamos", var->Settings.cfg.i_reversekey}, {"200fov", var->Settings.cfg.i_200fovkey}, {"chams", var->Settings.cfg.i_chamskey} };

	//favorites
	j["startup"] = { {"favorites", {"lootchecks", boolToInt(var->Settings.b_owner)}, {"unlockall", boolToInt(var->Settings.b_unlock)}, {"reversecamos", boolToInt(var->Settings.b_camo)}, 

	var->Settings.slot5 = atoi(data["startup"][4][15][1].dump().c_str());
	var->Settings.gamemodeselection = atoi(data["startup"][4][16][1].dump().c_str());
	var->Settings.attachselection = atoi(data["startup"][4][17][1].dump().c_str());
	var->Settings.deletebp = atoi(data["startup"][4][18][1].dump().c_str());
	f.close();
}



BOOL CALLBACK process::EnumWindowCallBack(HWND hWnd, LPARAM lParam)
{
	DWORD dwPid = 0;
	GetWindowThreadProcessId(hWnd, &dwPid);
	if (dwPid == lParam)
	{
		hwnd = hWnd;
		return FALSE;
	}
	return TRUE;
}

HWND process::get_process_window()
{
	if (hwnd)
		return hwnd;

	EnumWindows(process::EnumWindowCallBack, GetCurrentProcessId());

	if (hwnd == NULL)
		Exit();

	return hwnd;
}

HWND process::get_process_window(DWORD procID)
{
	if (hwnd)
		return hwnd;

	EnumWindows(process::EnumWindowCallBack, procID);

	if (hwnd == NULL)
		Exit();

	return hwnd;
}

namespace g_game
{
	void main_loop(ImFont* font);
	void ui_header()
	{
		if (var->Settings.open)
		{
			ImGuiIO& io = ImGui::GetIO();
			ImGui::PushStyleColor(ImGuiCol_WindowBg, ImVec4(0.0f, 0.0f, 0.0f, 0.01f));
			ImGui::Begin("A", reinterpret_cast<bool*>(true), ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove | ImGuiWindowFlags_NoBringToFrontOnFocus);
			ImGui::SetWindowPos(ImVec2(0, 0), ImGuiCond_Always);
			ImGui::SetWindowSize(ImVec2(ImGui::GetIO().DisplaySize.x, ImGui::GetIO().DisplaySize.y), ImGuiCond_Always);
			ImU32 status = IM_COL32(255, 0, 0, 255);
			int dwWidth = GetSystemMetrics(SM_CXSCREEN) / 4;
			int dwHeight = GetSystemMetrics(SM_CYSCREEN) / 2;
			//ImGui::GetForegroundDrawList()->AddRectFilled({ 10, 25 }, { 25,10 }, status, .4f, 10);
			//ImGui::GetForegroundDrawList()->AddText(ImVec2(dwWidth * 3.5f, 40), status, ICON_FA_GAMEPAD);
			//ImGui::GetForegroundDrawList()->AddText(ImVec2(20, 20), status, ICON_FA_GAMEPAD);
		}
		else
		{
			ImGui::PushStyleColor(ImGuiCol_WindowBg, ImVec4(0.0f, 0.0f, 0.0f, 0.0f));
			ImGui::Begin("A", reinterpret_cast<bool*>(true), ImGuiWindowFlags_NoTitleBar | ImGuiWindowFlags_NoResize | ImGuiWindowFlags_NoMove | ImGuiWindowFlags_NoBringToFrontOnFocus);
			ImGui::SetWindowPos(ImVec2(0, 0), ImGuiCond_Always);
			ImGui::SetWindowSize(ImVec2(ImGui::GetIO().DisplaySize.x, ImGui::GetIO().DisplaySize.y), ImGuiCond_Always);
			int dwWidth = GetSystemMetrics(SM_CXSCREEN) / 4;
			int dwHeight = GetSystemMetrics(SM_CYSCREEN) / 2;
			ImU32 status = IM_COL32(255, 0, 0, 255);
			//ImGui::GetForegroundDrawList()->AddCircleFilled({ 20, 20 }, 5, status);
			//ImGui::GetForegroundDrawList()->AddText(ImVec2(dwWidth * 3.5f, 50), 6, status);
			//ImGui::GetForegroundDrawList()->AddText(ImVec2(20, 20), status, ICON_FA_GAMEPAD);
		}
	}

	void ui_end()
	{
		ImGuiWindow* window = ImGui::GetCurrentWindow();
		window->DrawList->PushClipRectFullScreen();
		ImGui::End();
		ImGui::PopStyleColor();
	}

	void init(ImFont* font)
	{
		ui_header();
		main_loop(font);
		ui_end();
	}

	struct GfxHudOutlineState// Size=0x118
	{
		bool enable;// Offset=0x0 Size=0x1
		unsigned int mode;// Offset=0x4 Size=0x4
		float width;// Offset=0x28 Size=0x4
		float scopeWidth;// Offset=0x7c Size=0x4
		float occludedColorFromFill;// Offset=0x110 Size=0x4
		bool depthTestInScope;// Offset=0x114 Size=0x1
		bool fillInScope;// Offset=0x115 Size=0x1
	};

	struct GfxSceneHudOutlineInfo// Size=0x24
	{
		unsigned int color;// Offset=0x0 Size=0x4
		float scopeStencil;// Offset=0x4 Size=0x4
		bool drawOccludedPixels;// Offset=0x8 Size=0x1
		bool drawNonOccludedPixels;// Offset=0x9 Size=0x1
		bool fill;// Offset=0xa Size=0x1
		bool useAlternateColor;// Offset=0xb Size=0x1
		bool forSpectator;// Offset=0xc Size=0x1
		bool specialActive;// Offset=0xd Size=0x1
		unsigned char renderMode;// Offset=0xe Size=0x1
		unsigned char lineWidth;// Offset=0xf Size=0x1
		unsigned char temperatureSet;// Offset=0x10 Size=0x1
		unsigned int mapEntLookup;// Offset=0x14 Size=0x4
		float temperatureBase;// Offset=0x18 Size=0x4
		float temperatureScale;// Offset=0x1c Size=0x4
		float characterEVOffset;// Offset=0x20 Size=0x4
	};

	enum HudOutlineColor
	{
		HUD_OUTLINE_COLOR_NONE = 0,
		HUD_OUTLINE_COLOR_WHITE = 1,
		HUD_OUTLINE_COLOR_RED = 2,
		HUD_OUTLINE_COLOR_GREEN = 3,
		HUD_OUTLINE_COLOR_CYAN = 4,
		HUD_OUTLINE_COLOR_ORANGE = 5,
		HUD_OUTLINE_COLOR_YELLOW = 6,
		HUD_OUTLINE_COLOR_SCOPE = 7,
		HUD_OUTLINE_COLOR_MLG_ENEMY = 8,
		HUD_OUTLINE_COLOR_MLG_FRIEND = 9,
		HUD_OUTLINE_COLOR_MLG_TEAM0 = 10,
		HUD_OUTLINE_COLOR_MLG_TEAM1 = 11,
		HUD_OUTLINE_COLOR_MAX = 12
	};

	enum PlayerOutlineColorMode
	{
		COLOR_BY_VIEWER_TEAM = 0,
		COLOR_BY_TEAM_COLOR = 1
	};

	enum PlayerOutlineViewMode
	{
		OUTLINE_ALL = 0,
		OUTLINE_SAME_TEAM = 1,
		OUTLINE_OPPOSITE_TEAM = 2,
		OUTLINE_NONE = 3
	};

	struct GfxSceneEntityMutableShaderData
	{
		char pad[0x88];
		GfxSceneHudOutlineInfo hudOutlineInfo;
	};

	struct CgCompassSystemMP
	{
		char pad[0xFF00];
		//GfxSceneHudOutlineInfo hudOutlineInfo;
	};

